app/controllers/searches_controller.rb

  def index
    @results = Giphy.search('star wars', {limit: 30, offset: rand(1..100)})
---
SELECT  "searches".* FROM "searches" WHERE "searches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    @character = Giphy.search("#{Search.find(params[:id]).name}", {limit: 30, offset: rand(1..100)})
---
SELECT  "searches".* FROM "searches" WHERE "searches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]